zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT1186/gcc/startup_MIMXRT1186_cm7.S
/* ------------------------------------------------------------------------- */
/*  @file:    startup_MIMXRT1186_cm7.s                                       */
/*  @purpose: CMSIS Cortex-M7 Core Device Startup File                       */
/*            MIMXRT1186_cm7                                                 */
/*  @version: 3.0                                                            */
/*  @date:    2024-10-29                                                     */
/*  @build:   b250520                                                        */
/* ------------------------------------------------------------------------- */
/*                                                                           */
/* Copyright 1997-2016 Freescale Semiconductor, Inc.                         */
/* Copyright 2016-2025 NXP                                                   */
/* SPDX-License-Identifier: BSD-3-Clause                                     */
/*****************************************************************************/
/* Version: GCC for ARM Embedded Processors                                  */
/*****************************************************************************/
    .syntax unified
    .arch armv7-m

    .section .isr_vector, "a"
    .align 2
    .globl __isr_vector
__isr_vector:
    .long   __StackTop                                      /* Top of Stack */
    .long   Reset_Handler                                   /* Reset Handler */
    .long   NMI_Handler                                     /* NMI Handler*/
    .long   HardFault_Handler                               /* Hard Fault Handler*/
    .long   MemManage_Handler                               /* MPU Fault Handler*/
    .long   BusFault_Handler                                /* Bus Fault Handler*/
    .long   UsageFault_Handler                              /* Usage Fault Handler*/
    .long   0                                               /* Reserved*/
    .long   0                                               /* Reserved*/
    .long   0                                               /* Reserved*/
    .long   0                                               /* Reserved*/
    .long   SVC_Handler                                     /* SVCall Handler*/
    .long   DebugMon_Handler                                /* Debug Monitor Handler*/
    .long   0                                               /* Reserved*/
    .long   PendSV_Handler                                  /* PendSV Handler*/
    .long   SysTick_Handler                                 /* SysTick Handler*/

                                                            /* External Interrupts*/
    .long   TMR1_IRQHandler                                 /* TMR1 interrupt*/
    .long   DAP_IRQHandler                                  /* DAP interrupt*/
    .long   M7_CTI_TRIGGER_OUTPUT_IRQHandler                /* CTI trigger outputs from CM7*/
    .long   M33_CTI_TRIGGER_OUTPUT_IRQHandler               /* CTI trigger outputs from CM33*/
    .long   TMR5_IRQHandler                                 /* TMR5 interrupt*/
    .long   TMR6_IRQHandler                                 /* TMR6 interrupt*/
    .long   TMR7_IRQHandler                                 /* TMR7 interrupt*/
    .long   TMR8_IRQHandler                                 /* TMR8 interrupt*/
    .long   CAN1_IRQHandler                                 /* CAN1 interrupt*/
    .long   CAN1_ERROR_IRQHandler                           /* CAN1 error interrupt*/
    .long   GPIO1_0_IRQHandler                              /* GPIO1 interrupt 0*/
    .long   GPIO1_1_IRQHandler                              /* GPIO1 interrupt 1*/
    .long   I3C1_IRQHandler                                 /* I3C1 interrupt*/
    .long   LPI2C1_IRQHandler                               /* LPI2C1 interrupt*/
    .long   LPI2C2_IRQHandler                               /* LPI2C2 interrupt*/
    .long   LPIT1_IRQHandler                                /* LPIT1 interrupt*/
    .long   LPSPI1_IRQHandler                               /* LPSPI1 interrupt*/
    .long   LPSPI2_IRQHandler                               /* LPSPI2 interrupt*/
    .long   LPTMR1_IRQHandler                               /* LPTMR1 interrupt*/
    .long   LPUART1_IRQHandler                              /* LPUART1 interrupt*/
    .long   LPUART2_IRQHandler                              /* LPUART2 interrupt*/
    .long   MU1_IRQHandler                                  /* MU1 interrupt*/
    .long   MU2_IRQHandler                                  /* MU2 interrupt*/
    .long   PWM1_FAULT_IRQHandler                           /* PWM1 fault or reload error interrupt*/
    .long   PWM1_0_IRQHandler                               /* PWM1 capture 0, compare 0, or reload 0 interrupt*/
    .long   PWM1_1_IRQHandler                               /* PWM1 capture 1, compare 1, or reload 1 interrupt*/
    .long   PWM1_2_IRQHandler                               /* PWM1 capture 2, compare 2, or reload 2 interrupt*/
    .long   PWM1_3_IRQHandler                               /* PWM1 capture 3, compare 3, or reload 3 interrupt*/
    .long   EDGELOCK_TRUST_MUA_RX_FULL_IRQHandler           /* Edgelock Trust MUA RX full interrupt*/
    .long   EDGELOCK_TRUST_MUA_TX_EMPTY_IRQHandler          /* Edgelock Trust MUA TX empty interrupt*/
    .long   EDGELOCK_APPS_CORE_MUA_RX_FULL_IRQHandler       /* Edgelock Apps Core MUA RX full interrupt*/
    .long   EDGELOCK_APPS_CORE_MUA_TX_EMPTY_IRQHandler      /* Edgelock Apps Core MUA TX empty interrupt*/
    .long   EDGELOCK_REALTIME_CORE_MUA_RX_FULL_IRQHandler   /* Edgelock Realtime Core MUA RX full interrupt*/
    .long   EDGELOCK_REALTIME_CORE_MUA_TX_EMPTY_IRQHandler  /* Edgelock Realtime Core MUA TX empty interrupt*/
    .long   EDGELOCK_SECURE_IRQHandler                      /* Edgelock secure interrupt*/
    .long   EDGELOCK_NONSECURE_IRQHandler                   /* Edgelock non-secure interrupt*/
    .long   TPM1_IRQHandler                                 /* TPM1 interrupt*/
    .long   TPM2_IRQHandler                                 /* TPM2 interrupt*/
    .long   RTWDOG1_IRQHandler                              /* RTWDOG1 interrupt*/
    .long   RTWDOG2_IRQHandler                              /* RTWDOG2 interrupt*/
    .long   TRDC_MGR_AON_IRQHandler                         /* AONMIX TRDC transfer error interrupt*/
    .long   PDM_HWVAD_EVENT_IRQHandler                      /* HWVAD event interrupt*/
    .long   PDM_HWVAD_ERROR_IRQHandler                      /* HWVAD error interrupt*/
    .long   PDM_EVENT_IRQHandler                            /* PDM event interrupt*/
    .long   PDM_ERROR_IRQHandler                            /* PDM error interrupt*/
    .long   SAI1_IRQHandler                                 /* SAI interrupt*/
    .long   CM33_PS_IRQHandler                              /* M33 PS Tag/Data Parity Error*/
    .long   CM33_TCM_ECC_IRQHandler                         /* M33 TCM ECC interrupt*/
    .long   CM33_TCM_ERROR_IRQHandler                       /* M33 TCM Error interrupt*/
    .long   CM7_TCM_ECC_IRQHandler                          /* M7 TCM ECC interrupt*/
    .long   CM7_TCM_ERROR_IRQHandler                        /* M7 TCM Error interrupt*/
    .long   CAN2_IRQHandler                                 /* CAN2 interrupt*/
    .long   CAN2_ERROR_IRQHandler                           /* CAN2 error interrupt*/
    .long   FLEXIO1_IRQHandler                              /* FLEXIO1 interrupt*/
    .long   FLEXIO2_IRQHandler                              /* FLEXIO2 interrupt*/
    .long   FLEXSPI1_IRQHandler                             /* FLEXSPI1 interrupt*/
    .long   FLEXSPI2_IRQHandler                             /* FLEXSPI2 interrupt*/
    .long   GPIO2_0_IRQHandler                              /* GPIO2 interrupt 0*/
    .long   GPIO2_1_IRQHandler                              /* GPIO2 interrupt 1*/
    .long   GPIO3_0_IRQHandler                              /* GPIO3 interrupt 0*/
    .long   GPIO3_1_IRQHandler                              /* GPIO3 interrupt 1*/
    .long   I3C2_IRQHandler                                 /* I3C2 interrupt*/
    .long   LPI2C3_IRQHandler                               /* LPI2C3 interrupt*/
    .long   Reserved79_IRQHandler                           /* Reserved interrupt*/
    .long   LPIT2_IRQHandler                                /* LPIT2 interrupt*/
    .long   LPSPI3_IRQHandler                               /* LPSPI3 interrupt*/
    .long   LPSPI4_IRQHandler                               /* LPSPI4 interrupt*/
    .long   LPTMR2_IRQHandler                               /* LPTMR2 interrupt*/
    .long   LPUART3_IRQHandler                              /* LPUART3 interrupt*/
    .long   LPUART4_IRQHandler                              /* LPUART4 interrupt*/
    .long   LPUART5_IRQHandler                              /* LPUART5 interrupt*/
    .long   LPUART6_IRQHandler                              /* LPUART6 interrupt*/
    .long   Reserved88_IRQHandler                           /* Reserved interrupt 88*/
    .long   BBNSM_IRQHandler                                /* BBNSM iterrupt*/
    .long   SYS_CTR1_IRQHandler                             /* System Counter compare interrupt 0 and 1*/
    .long   TPM3_IRQHandler                                 /* TPM3 interrupt*/
    .long   TPM4_IRQHandler                                 /* TPM4 interrupt*/
    .long   Reserved93_IRQHandler                           /* Reserved interrupt*/
    .long   Reserved94_IRQHandler                           /* Reserved interrupt*/
    .long   RTWDOG3_IRQHandler                              /* RTWDOG3 interrupt*/
    .long   RTWDOG4_IRQHandler                              /* RTWDOG4 interrupt*/
    .long   RTWDOG5_IRQHandler                              /* RTWDOG5 interrupt*/
    .long   TRDC_MGR_WKUP_IRQHandler                        /* WAKEUPMIX TRDC transfer error interrupt*/
    .long   TMPSNS_INT_IRQHandler                           /* Temperature alarm interrupt*/
    .long   BBSM_IRQHandler                                 /* BBSM wakeup alarm interrupt*/
    .long   LDO_AON_ANA_IRQHandler                          /* Brown out interrupt*/
    .long   Reserved102_IRQHandler                          /* Reserved interrupt*/
    .long   USDHC2_IRQHandler                               /* USDHC2*/
    .long   TRDC_MGR_MEGA_IRQHandler                        /* MEGAMIX TRDC transfer error interrupt*/
    .long   SFA_IRQHandler                                  /* Signal Frequency Analyzer interrupt*/
    .long   LDO_AON_DIG_IRQHandler                          /* Brown out interrupt*/
    .long   MECC1_IRQHandler                                /* MECC1 interrupt*/
    .long   MECC2_IRQHandler                                /* MECC2 interrupt*/
    .long   ADC1_IRQHandler                                 /* ADC1 interrupt*/
    .long   DMA_ERROR_IRQHandler                            /* AON Domain eDMA error interrupt*/
    .long   DMA3_CH0_IRQHandler                             /* AON Domain eDMA channel 0 interrupt*/
    .long   DMA3_CH1_IRQHandler                             /* AON Domain eDMA channel 1 interrupt*/
    .long   DMA3_CH2_IRQHandler                             /* AON Domain eDMA channel 2 interrupt*/
    .long   DMA3_CH3_IRQHandler                             /* AON Domain eDMA channel 3 interrupt*/
    .long   DMA3_CH4_IRQHandler                             /* AON Domain eDMA channel 4 interrupt*/
    .long   DMA3_CH5_IRQHandler                             /* AON Domain eDMA channel 5 interrupt*/
    .long   DMA3_CH6_IRQHandler                             /* AON Domain eDMA channel 6 interrupt*/
    .long   DMA3_CH7_IRQHandler                             /* AON Domain eDMA channel 7 interrupt*/
    .long   DMA3_CH8_IRQHandler                             /* AON Domain eDMA channel 8 interrupt*/
    .long   DMA3_CH9_IRQHandler                             /* AON Domain eDMA channel 9 interrupt*/
    .long   DMA3_CH10_IRQHandler                            /* AON Domain eDMA channel 10 interrupt*/
    .long   DMA3_CH11_IRQHandler                            /* AON Domain eDMA channel 11 interrupt*/
    .long   DMA3_CH12_IRQHandler                            /* AON Domain eDMA channel 12 interrupt*/
    .long   DMA3_CH13_IRQHandler                            /* AON Domain eDMA channel 13 interrupt*/
    .long   DMA3_CH14_IRQHandler                            /* AON Domain eDMA channel 14 interrupt*/
    .long   DMA3_CH15_IRQHandler                            /* AON Domain eDMA channel 15 interrupt*/
    .long   DMA3_CH16_IRQHandler                            /* AON Domain eDMA channel 16 interrupt*/
    .long   DMA3_CH17_IRQHandler                            /* AON Domain eDMA channel 17 interrupt*/
    .long   DMA3_CH18_IRQHandler                            /* AON Domain eDMA channel 18 interrupt*/
    .long   DMA3_CH19_IRQHandler                            /* AON Domain eDMA channel 19 interrupt*/
    .long   DMA3_CH20_IRQHandler                            /* AON Domain eDMA channel 20 interrupt*/
    .long   DMA3_CH21_IRQHandler                            /* AON Domain eDMA channel 21 interrupt*/
    .long   DMA3_CH22_IRQHandler                            /* AON Domain eDMA channel 22 interrupt*/
    .long   DMA3_CH23_IRQHandler                            /* AON Domain eDMA channel 23 interrupt*/
    .long   DMA3_CH24_IRQHandler                            /* AON Domain eDMA channel 24 interrupt*/
    .long   DMA3_CH25_IRQHandler                            /* AON Domain eDMA channel 25 interrupt*/
    .long   DMA3_CH26_IRQHandler                            /* AON Domain eDMA channel 26 interrupt*/
    .long   DMA3_CH27_IRQHandler                            /* AON Domain eDMA channel 27 interrupt*/
    .long   DMA3_CH28_IRQHandler                            /* AON Domain eDMA channel 28 interrupt*/
    .long   DMA3_CH29_IRQHandler                            /* AON Domain eDMA channel 29 interrupt*/
    .long   DMA3_CH30_IRQHandler                            /* AON Domain eDMA channel 30 interrupt*/
    .long   DMA3_CH31_IRQHandler                            /* AON Domain eDMA channel 31 interrupt*/
    .long   DMA4_ERROR_IRQHandler                           /* WAKEUP Domain eDMA error interrupt*/
    .long   DMA4_CH0_CH1_CH32_CH33_IRQHandler               /* WAKEUP Domain eDMA channel 0/1/32/33 interrupt*/
    .long   DMA4_CH2_CH3_CH34_CH35_IRQHandler               /* WAKEUP Domain eDMA channel 2/3/34/35 interrupt*/
    .long   DMA4_CH4_CH5_CH36_CH37_IRQHandler               /* WAKEUP Domain eDMA channel 4/5/36/37 interrupt*/
    .long   DMA4_CH6_CH7_CH38_CH39_IRQHandler               /* WAKEUP Domain eDMA channel 6/7/38/39 interrupt*/
    .long   DMA4_CH8_CH9_CH40_CH41_IRQHandler               /* WAKEUP Domain eDMA channel 8/9/40/41 interrupt*/
    .long   DMA4_CH10_CH11_CH42_CH43_IRQHandler             /* WAKEUP Domain eDMA channel 10/11/42/43 interrupt*/
    .long   DMA4_CH12_CH13_CH44_CH45_IRQHandler             /* WAKEUP Domain eDMA channel 12/13/44/45 interrupt*/
    .long   DMA4_CH14_CH15_CH46_CH47_IRQHandler             /* WAKEUP Domain eDMA channel 14/15/46/47 interrupt*/
    .long   DMA4_CH16_CH17_CH48_CH49_IRQHandler             /* WAKEUP Domain eDMA channel 16/17/48/49 interrupt*/
    .long   DMA4_CH18_CH19_CH50_CH51_IRQHandler             /* WAKEUP Domain eDMA channel 18/19/50/51 interrupt*/
    .long   DMA4_CH20_CH21_CH52_CH53_IRQHandler             /* WAKEUP Domain eDMA channel 20/21/52/53 interrupt*/
    .long   DMA4_CH22_CH23_CH54_CH55_IRQHandler             /* WAKEUP Domain eDMA channel 22/23/54/55 interrupt*/
    .long   DMA4_CH24_CH25_CH56_CH57_IRQHandler             /* WAKEUP Domain eDMA channel 24/25/56/57 interrupt*/
    .long   DMA4_CH26_CH27_CH58_CH59_IRQHandler             /* WAKEUP Domain eDMA channel 26/27/58/59 interrupt*/
    .long   DMA4_CH28_CH29_CH60_CH61_IRQHandler             /* WAKEUP Domain eDMA channel 28/29/60/61 interrupt*/
    .long   DMA4_CH30_CH31_CH62_CH63_IRQHandler             /* WAKEUP Domain eDMA channel 30/31/62/63 interrupt*/
    .long   XBAR1_CH0_CH1_IRQHandler                        /* XBAR1 channel 0/1 interrupt*/
    .long   XBAR1_CH2_CH3_IRQHandler                        /* XBAR1 channel 2/3 interrupt*/
    .long   SINC3_CH0_CH1_CH2_CH3_IRQHandler                /* SINC Filter Glue 3 channel 0/1/2/3*/
    .long   EWM_IRQHandler                                  /* EWM reset out interrupt*/
    .long   SEMC_IRQHandler                                 /* SEMC interrupt*/
    .long   LPIT3_IRQHandler                                /* LPIT3 interrupt*/
    .long   LPTMR3_IRQHandler                               /* LPTMR3 interrupt*/
    .long   TMR4_IRQHandler                                 /* TMR4 interrupt*/
    .long   Reserved168_IRQHandler                          /* Reserved interrupt*/
    .long   LPI2C6_IRQHandler                               /* LPI2C6 interrupt*/
    .long   SAI4_IRQHandler                                 /* SAI4 interrupt*/
    .long   SPDIF_IRQHandler                                /* SPDIF interrupt*/
    .long   Reserved172_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved173_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved174_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved175_IRQHandler                          /* Reserved interrupt*/
    .long   INTG_BOOTROM_DEBUG_CTRL_IRQHandler              /* CM33, CM7, DAP access IRQ*/
    .long   EDGELOCK_REQ1_IRQHandler                        /* Edgelock reuqest 1 interrupt*/
    .long   EDGELOCK_REQ2_IRQHandler                        /* Edgelock reuqest 2 interrupt*/
    .long   EDGELOCK_REQ3_IRQHandler                        /* Edgelock reuqest 3 interrupt*/
    .long   TMR3_IRQHandler                                 /* TMR3 interrupt*/
    .long   JTAGC_IRQHandler                                /* JTAGC SRC reset source*/
    .long   M33_SYSRESET_REQ_IRQHandler                     /* CM33 SYSREQRST SRC reset source*/
    .long   M33_LOCKUP_IRQHandler                           /* CM33 LOCKUP SRC reset source*/
    .long   M7_SYSRESET_REQ_IRQHandler                      /* CM33 SYSREQRST SRC reset source*/
    .long   M7_LOCKUP_IRQHandler                            /* CM33 LOCKUP SRC reset source*/
    .long   PWM2_FAULT_IRQHandler                           /* PWM2 fault or reload error interrupt*/
    .long   PWM2_0_IRQHandler                               /* PWM2 capture 0, compare 0, or reload 0 interrupt*/
    .long   PWM2_1_IRQHandler                               /* PWM2 capture 1, compare 1, or reload 1 interrupt*/
    .long   PWM2_2_IRQHandler                               /* PWM2 capture 2, compare 2, or reload 2 interrupt*/
    .long   PWM2_3_IRQHandler                               /* PWM2 capture 3, compare 3, or reload 3 interrupt*/
    .long   PWM3_FAULT_IRQHandler                           /* PWM3 fault or reload error interrupt*/
    .long   PWM3_0_IRQHandler                               /* PWM3 capture 0, compare 0, or reload 0 interrupt*/
    .long   PWM3_1_IRQHandler                               /* PWM3 capture 1, compare 1, or reload 1 interrupt*/
    .long   PWM3_2_IRQHandler                               /* PWM3 capture 2, compare 2, or reload 2 interrupt*/
    .long   PWM3_3_IRQHandler                               /* PWM3 capture 3, compare 3, or reload 3 interrupt*/
    .long   PWM4_FAULT_IRQHandler                           /* PWM4 fault or reload error interrupt*/
    .long   PWM4_0_IRQHandler                               /* PWM4 capture 0, compare 0, or reload 0 interrupt*/
    .long   PWM4_1_IRQHandler                               /* PWM4 capture 1, compare 1, or reload 1 interrupt*/
    .long   PWM4_2_IRQHandler                               /* PWM4 capture 2, compare 2, or reload 2 interrupt*/
    .long   PWM4_3_IRQHandler                               /* PWM4 capture 3, compare 3, or reload 3 interrupt*/
    .long   EQDC1_IRQHandler                                /* EQDC1 interrupt*/
    .long   EQDC2_IRQHandler                                /* EQDC2 interrupt*/
    .long   EQDC3_IRQHandler                                /* EQDC3 interrupt*/
    .long   EQDC4_IRQHandler                                /* EQDC4 interrupt*/
    .long   ADC2_IRQHandler                                 /* ADC2 interrupt*/
    .long   DCDC_IRQHandler                                 /* DCDC brown out interrupt*/
    .long   Reserved207_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved208_IRQHandler                          /* Reserved interrupt*/
    .long   DAC_IRQHandler                                  /* DAC interrupt*/
    .long   LPSPI5_IRQHandler                               /* LPSPI5 interrupt*/
    .long   LPSPI6_IRQHandler                               /* LPSPI6 interrupt*/
    .long   LPUART7_IRQHandler                              /* LPUART7 interrupt*/
    .long   LPUART8_IRQHandler                              /* LPUART8 interrupt*/
    .long   SAI2_IRQHandler                                 /* SAI2 interrupt*/
    .long   Reserved215_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved216_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved217_IRQHandler                          /* Reserved interrupt*/
    .long   ACMP3_IRQHandler                                /* CMP3 interrupt*/
    .long   Reserved219_IRQHandler                          /* Reserved interrupt*/
    .long   CM7_PS_IRQHandler                               /* M7 PS Tag/Data Parity Error*/
    .long   CM7_MCM_IRQHandler                              /* M7 MCM interrupt*/
    .long   CM33_MCM_IRQHandler                             /* M33 MCM interrupt*/
    .long   ECAT_INT_IRQHandler                             /* EtherCAT interrupt*/
    .long   SAFETY_CLK_MON_IRQHandler                       /* Safety clock monitor interrupt*/
    .long   GPT1_IRQHandler                                 /* GPT1 interrupt*/
    .long   GPT2_IRQHandler                                 /* GPT2 interrupt*/
    .long   KPP_IRQHandler                                  /* KPP interrupt*/
    .long   USBPHY1_IRQHandler                              /* USBPHY1 interrupt*/
    .long   Reserved229_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved230_IRQHandler                          /* Reserved interrupt*/
    .long   USB_OTG1_IRQHandler                             /* USBOTG1 interrupt*/
    .long   FLEXSPI_SLV_IRQHandler                          /* FLEXSPI follower interrupt*/
    .long   NETC_IRQHandler                                 /* NETC interrupt*/
    .long   MSGINTR1_IRQHandler                             /* MSGINTR1 interrupt*/
    .long   MSGINTR2_IRQHandler                             /* MSGINTR2 interrupt*/
    .long   MSGINTR3_IRQHandler                             /* MSGINTR3 interrupt*/
    .long   MSGINTR4_IRQHandler                             /* MSGINTR4 interrupt*/
    .long   MSGINTR5_IRQHandler                             /* MSGINTR5 interrupt*/
    .long   MSGINTR6_IRQHandler                             /* MSGINTR6 interrupt*/
    .long   SINC1_CH0_IRQHandler                            /* SINC Filter Glue 1 channel 0*/
    .long   SINC1_CH1_IRQHandler                            /* SINC Filter Glue 1 channel 1*/
    .long   SINC1_CH2_IRQHandler                            /* SINC Filter Glue 1 channel 2*/
    .long   SINC1_CH3_IRQHandler                            /* SINC Filter Glue 1 channel 3*/
    .long   SINC2_CH0_IRQHandler                            /* SINC Filter Glue 2 channel 0*/
    .long   SINC2_CH1_IRQHandler                            /* SINC Filter Glue 2 channel 1*/
